In [1]:
import pandas as pd

In [6]:
fruits = {
    "apple":[3, 2, 0, 1],
    "oranges":[0, 3, 7, 1]
}

#dataframe means having multiple dimension
#series means having one dimension
fruits = pd.DataFrame(fruits, index = ["Sunday", "Monday", "Tuesday", "Wednesday"])
fruits

           apple  oranges
Sunday         3        0
Monday         2        3
Tuesday        0        7
Wednesday      1        1

# Merging

In [8]:
df1 = pd.DataFrame({"HPI":[80, 90, 70, 60], "Int_Rate":[2, 1, 2, 3],
                   "IND_GDP":[50, 45, 45, 67]}, index = [2001, 2002, 2003, 2004])

df2 = pd.DataFrame({"HPI":[80, 90, 70, 60], "Int_Rate":[2, 1, 2, 3],
                   "IND_GDP":[50, 45, 45, 67]}, index = [2001, 2002, 2003, 2004])

print(df1, df2)

      HPI  Int_Rate  IND_GDP
2001   80         2       50
2002   90         1       45
2003   70         2       45
2004   60         3       67       HPI  Int_Rate  IND_GDP
2001   80         2       50
2002   90         1       45
2003   70         2       45
2004   60         3       67

In [11]:
#how means which join do you prefer like 
#inner join, outer join, left or right join

#on means which columns or attributes do you want to give more priority
merged = pd.merge(df1, df2, on = 'HPI')
merged

   HPI  Int_Rate_x  IND_GDP_x  Int_Rate_y  IND_GDP_y
0   80           2         50           2         50
1   90           1         45           1         45
2   70           2         45           2         45
3   60           3         67           3         67

# Joining

In [14]:
df1 = pd.DataFrame({"Int_Rate":[2, 1, 2, 3],
                   "IND_GDP":[50, 45, 45, 67]}, index = [2001, 2002, 2003, 2004])

df2 = pd.DataFrame({"Low_Tier_Rate":[50, 45, 67, 34],
                   "UnEmployment":[1, 3, 5, 6]}, index = [2001, 2003, 2004, 2005])

In [15]:
joined = df1.join(df2)
joined

      Int_Rate  IND_GDP  Low_Tier_Rate  UnEmployment
2001         2       50           50.0           1.0
2002         1       45            NaN           NaN
2003         2       45           45.0           3.0
2004         3       67           67.0           5.0

In [16]:
concated = pd.concat([df1, df2])
concated

      Int_Rate  IND_GDP  Low_Tier_Rate  UnEmployment
2001       2.0     50.0            NaN           NaN
2002       1.0     45.0            NaN           NaN
2003       2.0     45.0            NaN           NaN
2004       3.0     67.0            NaN           NaN
2001       NaN      NaN           50.0           1.0
2003       NaN      NaN           45.0           3.0
2004       NaN      NaN           67.0           5.0
2005       NaN      NaN           34.0           6.0